In [13]:
import pandas as pd
import numpy as np

In [14]:
data = pd.Series(np.random.randn(9),
                 index=[['a', 'a', 'a', 'b', 'b', 'c', 'c', 'd', 'd'],
                        [1, 2, 3, 1, 3, 1, 2, 2, 3]])
data

a  1   -0.452641
   2   -0.577947
   3    0.857421
b  1    1.330264
   3    0.768297
c  1   -2.107464
   2    0.695251
d  2    0.594778
   3    2.812059
dtype: float64

In [15]:
data['a'][2] #srf iloc main numbers dety hn bqi main index ka name

-0.5779466236153629

In [16]:
data['d'][3]

2.812059102283954

In [17]:
data['c'][2]

0.695251476792566

In [18]:
data.index

MultiIndex([('a', 1),
            ('a', 2),
            ('a', 3),
            ('b', 1),
            ('b', 3),
            ('c', 1),
            ('c', 2),
            ('d', 2),
            ('d', 3)],
           )

In [19]:
# data[[0,1,2,3]][:,[1]] #error 
# arr[[1,5,7,2]][:,[0,3,1,2]]

In [20]:
data.loc[:, 2]

a   -0.577947
c    0.695251
d    0.594778
dtype: float64

In [21]:
data.loc[:,[2,1]]

a  1   -0.452641
   2   -0.577947
b  1    1.330264
c  1   -2.107464
   2    0.695251
d  2    0.594778
dtype: float64

In [22]:
data.loc[:'b',3]

a  3    0.857421
b  3    0.768297
dtype: float64

In [23]:
data.unstack() #dataframe bnadega index ki list fancy thi to pehli ko index banadia dsri ko column

          1         2         3
a -0.452641 -0.577947  0.857421
b  1.330264       NaN  0.768297
c -2.107464  0.695251       NaN
d       NaN  0.594778  2.812059

In [24]:
data.unstack().stack()

a  1   -0.452641
   2   -0.577947
   3    0.857421
b  1    1.330264
   3    0.768297
c  1   -2.107464
   2    0.695251
d  2    0.594778
   3    2.812059
dtype: float64

In [25]:
data.unstack(level=0)

          a         b         c         d
1 -0.452641  1.330264 -2.107464       NaN
2 -0.577947       NaN  0.695251  0.594778
3  0.857421  0.768297       NaN  2.812059

In [26]:
frame = pd.DataFrame(np.arange(12).reshape((4,3)),
                    index=[['a','a','b','b'],[1,2,1,2]],
                    columns= [['Pakistan','Pakistan','India'],
                    ['Karachi','Lahore','Bangalore']])
frame

    Pakistan            India
     Karachi Lahore Bangalore
a 1        0      1         2
  2        3      4         5
b 1        6      7         8
  2        9     10        11

In [27]:
frame['Pakistan']

     Karachi  Lahore
a 1        0       1
  2        3       4
b 1        6       7
  2        9      10

In [28]:
frame['Pakistan']['Lahore']['b'][2]

10

In [29]:
frame['Pakistan'].loc['b',2]

Karachi     9
Lahore     10
Name: (b, 2), dtype: int32

In [30]:
frame['Pakistan'].iloc[0:4]

     Karachi  Lahore
a 1        0       1
  2        3       4
b 1        6       7
  2        9      10

In [31]:
frame.columns.names = ['Country','City']
frame

Country Pakistan            India
City     Karachi Lahore Bangalore
a 1            0      1         2
  2            3      4         5
b 1            6      7         8
  2            9     10        11

# 8/12/2019

In [32]:
df2 = pd.DataFrame({'key': ['a', 'b', 'd'],
                    'common':['m', 'n', 'd'],
                    'data2': range(3)})
df2

  key common  data2
0   a      m      0
1   b      n      1
2   d      d      2

In [33]:
df1 = pd.DataFrame({'key': ['b', 'b', 'a', 'c', 'a', 'a', 'b'],
                    'common': ['b', 'd', 'm', 'c', 'a', 'n', 'b'],
                    'data1': range(7)})
df1

  key common  data1
0   b      b      0
1   b      d      1
2   a      m      2
3   c      c      3
4   a      a      4
5   a      n      5
6   b      b      6

In [34]:
pd.merge(df1,df2) #total possible combinations , by default how='inner'

  key common  data1  data2
0   a      m      2      0

In [35]:
pd.merge(df1,df2,how='outer')

  key common  data1  data2
0   b      b    0.0    NaN
1   b      b    6.0    NaN
2   b      d    1.0    NaN
3   a      m    2.0    0.0
4   c      c    3.0    NaN
5   a      a    4.0    NaN
6   a      n    5.0    NaN
7   b      n    NaN    1.0
8   d      d    NaN    2.0

In [36]:
d1 = pd.DataFrame({'key':['mids','hash','max','mariam','wari'],
                   'common': ['mids','hash','max','mariam','wari'],
                  'data1':range(5)})
d1

      key  common  data1
0    mids    mids      0
1    hash    hash      1
2     max     max      2
3  mariam  mariam      3
4    wari    wari      4

In [37]:
d2 = pd.DataFrame({'key':['hash','max','mids'],
                   'common':['hash','mids','wari'],
                  'data2':range(3)})
d2

    key common  data2
0  hash   hash      0
1   max   mids      1
2  mids   wari      2

In [38]:
pd.merge(d1,d2) #how=inner

    key common  data1  data2
0  hash   hash      1      0

In [39]:
pd.merge(d1,d2,on='key') #common is key

    key common_x  data1 common_y  data2
0  mids     mids      0     wari      2
1  hash     hash      1     hash      0
2   max      max      2     mids      1

In [40]:
pd.merge(d1,d2,on='key',suffixes=('_left','_right')) #common_x --> common_left

    key common_left  data1 common_right  data2
0  mids        mids      0         wari      2
1  hash        hash      1         hash      0
2   max         max      2         mids      1

In [41]:
df3 = pd.DataFrame({'lkey': ['b', 'b', 'a', 'c', 'a', 'a', 'b'],
                    'data1': range(7)})
df3

  lkey  data1
0    b      0
1    b      1
2    a      2
3    c      3
4    a      4
5    a      5
6    b      6

In [42]:
df4 = pd.DataFrame({'rkey': ['a', 'b', 'd'],
                    'data2': range(3)})
df4

  rkey  data2
0    a      0
1    b      1
2    d      2

In [43]:
pd.merge(df3,df4,left_on='lkey',right_on='rkey')#agr srf df3,df4 dia to error q k kch common name nhi ta phr hmne do parameter pass kye left_on means left wala parameter i-e df3 ki lfey

  lkey  data1 rkey  data2
0    b      0    b      1
1    b      1    b      1
2    b      6    b      1
3    a      2    a      0
4    a      4    a      0
5    a      5    a      0

In [44]:
myd1 = pd.DataFrame({'score':[12,33,45,66,78],
                    'names':['h','m','k','r','t'],
                    })
myd1

   score names
0     12     h
1     33     m
2     45     k
3     66     r
4     78     t

In [45]:
myd2 = pd.DataFrame({'runs':[23,33,45,66,77],
                    'nam':['m','k','h','w','y']})
myd2

   runs nam
0    23   m
1    33   k
2    45   h
3    66   w
4    77   y

In [46]:
pd.merge(myd1,myd2,left_on='names',right_on='nam')

   score names  runs nam
0     12     h    45   h
1     33     m    23   m
2     45     k    33   k

In [47]:
pd.merge(myd1,myd2,left_on='names',right_on='nam',how='outer') #jinky pairs nhi hoty unko b

   score names  runs  nam
0   12.0     h  45.0    h
1   33.0     m  23.0    m
2   45.0     k  33.0    k
3   66.0     r   NaN  NaN
4   78.0     t   NaN  NaN
5    NaN   NaN  66.0    w
6    NaN   NaN  77.0    y

In [48]:
pd.merge(myd1,myd2,left_on='names',right_on='nam',how='left')

   score names  runs  nam
0     12     h  45.0    h
1     33     m  23.0    m
2     45     k  33.0    k
3     66     r   NaN  NaN
4     78     t   NaN  NaN

In [49]:
pd.merge(myd1,myd2,left_on='names',right_on='nam',how='right')

   score names  runs nam
0   12.0     h    45   h
1   33.0     m    23   m
2   45.0     k    33   k
3    NaN   NaN    66   w
4    NaN   NaN    77   y

In [50]:
df3

  lkey  data1
0    b      0
1    b      1
2    a      2
3    c      3
4    a      4
5    a      5
6    b      6

In [51]:
df4

  rkey  data2
0    a      0
1    b      1
2    d      2

In [52]:
df3.join(df4)

  lkey  data1 rkey  data2
0    b      0    a    0.0
1    b      1    b    1.0
2    a      2    d    2.0
3    c      3  NaN    NaN
4    a      4  NaN    NaN
5    a      5  NaN    NaN
6    b      6  NaN    NaN

In [67]:
#df3.join(df4,on=['lkey','data2'])

In [54]:
left2 = pd.DataFrame([[1., 2.], [3., 4.], [5., 6.]],index=['a', 'c', 'e'], columns=['Ohio', 'Nevada'])
left2

   Ohio  Nevada
a   1.0     2.0
c   3.0     4.0
e   5.0     6.0

In [55]:
right2 = pd.DataFrame([[7., 8.], [9., 10.], [11., 12.], [13, 14]],
index=['b', 'c', 'd', 'e'],columns=['Missouri', 'Alabama'])
right2

   Missouri  Alabama
b       7.0      8.0
c       9.0     10.0
d      11.0     12.0
e      13.0     14.0

In [56]:
left2.join(right2) #by default here is how='left'

   Ohio  Nevada  Missouri  Alabama
a   1.0     2.0       NaN      NaN
c   3.0     4.0       9.0     10.0
e   5.0     6.0      13.0     14.0

In [57]:
left2.join(right2,how='outer')

   Ohio  Nevada  Missouri  Alabama
a   1.0     2.0       NaN      NaN
b   NaN     NaN       7.0      8.0
c   3.0     4.0       9.0     10.0
d   NaN     NaN      11.0     12.0
e   5.0     6.0      13.0     14.0

In [58]:
left2.join(right2,how='inner')

   Ohio  Nevada  Missouri  Alabama
c   3.0     4.0       9.0     10.0
e   5.0     6.0      13.0     14.0

In [59]:
left2.join(right2,how='right')

   Ohio  Nevada  Missouri  Alabama
b   NaN     NaN       7.0      8.0
c   3.0     4.0       9.0     10.0
d   NaN     NaN      11.0     12.0
e   5.0     6.0      13.0     14.0

In [60]:
dff1 = pd.DataFrame(np.arange(6).reshape(3, 2), index=['a', 'b', 'c'],
                    columns=['one', 'two'])
dff1

   one  two
a    0    1
b    2    3
c    4    5

In [61]:
dff2 = pd.DataFrame(5 + np.arange(4).reshape(2, 2), index=['a', 'c'],
                   columns=['one', 'two'])
dff2

   one  two
a    5    6
c    7    8

In [62]:
pd.concat([dff1,dff2])

   one  two
a    0    1
b    2    3
c    4    5
a    5    6
c    7    8

In [63]:
dff1 = pd.DataFrame(np.arange(6).reshape(3, 2), index=['a', 'b', 'c'],
                    columns=['one', 'two'])
dff1

   one  two
a    0    1
b    2    3
c    4    5

In [64]:
dff2 = pd.DataFrame(np.arange(6).reshape(3, 2), index=['a', 'b', 'c'],
                    columns=['three', 'four'])
dff2

   three  four
a      0     1
b      2     3
c      4     5

In [65]:
pd.concat([dff1,dff2])

C:\Users\Midhas\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=False'.

To retain the current behavior and silence the warning, pass 'sort=True'.

  """Entry point for launching an IPython kernel.

   four  one  three  two
a   NaN  0.0    NaN  1.0
b   NaN  2.0    NaN  3.0
c   NaN  4.0    NaN  5.0
a   1.0  NaN    0.0  NaN
b   3.0  NaN    2.0  NaN
c   5.0  NaN    4.0  NaN

In [ ]:
#see remaining work in sir anees repo (pivot wagera)